zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MU.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_MU.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_MU
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_MU_H_)  /* Check if memory map has not been already included */
#define S32K566_MU_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- MU Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MU_Peripheral_Access_Layer MU Peripheral Access Layer
 * @{
 */

/** MU - Size of Registers Arrays */
#define MU_TR_COUNT                               4u
#define MU_RR_COUNT                               4u

/** MU - Register Layout Typedef */
typedef struct MU_Struct {
  __I  uint32_t VER;                               /**< Version ID, offset: 0x0 */
  __I  uint32_t PAR;                               /**< Parameter, offset: 0x4 */
  __IO uint32_t CR;                                /**< Control, offset: 0x8 */
  __IO uint32_t SR;                                /**< Status, offset: 0xC */
  __IO uint32_t CCR0;                              /**< Core Control 0, offset: 0x10 */
  __IO uint32_t CIER0;                             /**< Core Interrupt Enable 0, offset: 0x14 */
  __IO uint32_t CSSR0;                             /**< Core Sticky Status 0, offset: 0x18 */
  __I  uint32_t CSR0;                              /**< Core Status 0, offset: 0x1C, not available in all instances (available on 4 out of 8) */
  uint8_t RESERVED_0[224];
  __IO uint32_t FCR;                               /**< Flag Control, offset: 0x100 */
  __I  uint32_t FSR;                               /**< Flag Status, offset: 0x104 */
  uint8_t RESERVED_1[8];
  __IO uint32_t GIER;                              /**< General-Purpose Interrupt Enable, offset: 0x110 */
  __IO uint32_t GCR;                               /**< General-Purpose Control, offset: 0x114 */
  __IO uint32_t GSR;                               /**< General-purpose Status, offset: 0x118 */
  uint8_t RESERVED_2[4];
  __IO uint32_t TCR;                               /**< Transmit Control, offset: 0x120 */
  __I  uint32_t TSR;                               /**< Transmit Status, offset: 0x124 */
  __IO uint32_t RCR;                               /**< Receive Control, offset: 0x128 */
  __I  uint32_t RSR;                               /**< Receive Status, offset: 0x12C */
  uint8_t RESERVED_3[208];
  __IO uint32_t TR[MU_TR_COUNT];                   /**< Transmit, array offset: 0x200, array step: 0x4 */
  uint8_t RESERVED_4[112];
  __I  uint32_t RR[MU_RR_COUNT];                   /**< Receive, array offset: 0x280, array step: 0x4 */
} MU_Type, *MU_MemMapPtr;

/** Number of instances of the MU module. */
#define MU_INSTANCE_COUNT                        (8u)

/* MU - Peripheral instance base addresses */
/** Peripheral DSP4__MU0__MUA base address */
#define IP_DSP4__MU0__MUA_BASE                   (0x40A0C000u)
/** Peripheral DSP4__MU0__MUA base pointer */
#define IP_DSP4__MU0__MUA                        ((MU_Type *)IP_DSP4__MU0__MUA_BASE)
/** Peripheral DSP4__MU0__MUB base address */
#define IP_DSP4__MU0__MUB_BASE                   (0x42604000u)
/** Peripheral DSP4__MU0__MUB base pointer */
#define IP_DSP4__MU0__MUB                        ((MU_Type *)IP_DSP4__MU0__MUB_BASE)
/** Peripheral DSP4__MU1__MUA base address */
#define IP_DSP4__MU1__MUA_BASE                   (0x40A10000u)
/** Peripheral DSP4__MU1__MUA base pointer */
#define IP_DSP4__MU1__MUA                        ((MU_Type *)IP_DSP4__MU1__MUA_BASE)
/** Peripheral DSP4__MU1__MUB base address */
#define IP_DSP4__MU1__MUB_BASE                   (0x42608000u)
/** Peripheral DSP4__MU1__MUB base pointer */
#define IP_DSP4__MU1__MUB                        ((MU_Type *)IP_DSP4__MU1__MUB_BASE)
/** Peripheral DSP4__MU2__MUA base address */
#define IP_DSP4__MU2__MUA_BASE                   (0x40A14000u)
/** Peripheral DSP4__MU2__MUA base pointer */
#define IP_DSP4__MU2__MUA                        ((MU_Type *)IP_DSP4__MU2__MUA_BASE)
/** Peripheral DSP4__MU2__MUB base address */
#define IP_DSP4__MU2__MUB_BASE                   (0x4260C000u)
/** Peripheral DSP4__MU2__MUB base pointer */
#define IP_DSP4__MU2__MUB                        ((MU_Type *)IP_DSP4__MU2__MUB_BASE)
/** Peripheral DSP4__MU3__MUA base address */
#define IP_DSP4__MU3__MUA_BASE                   (0x40A18000u)
/** Peripheral DSP4__MU3__MUA base pointer */
#define IP_DSP4__MU3__MUA                        ((MU_Type *)IP_DSP4__MU3__MUA_BASE)
/** Peripheral DSP4__MU3__MUB base address */
#define IP_DSP4__MU3__MUB_BASE                   (0x42610000u)
/** Peripheral DSP4__MU3__MUB base pointer */
#define IP_DSP4__MU3__MUB                        ((MU_Type *)IP_DSP4__MU3__MUB_BASE)
/** Array initializer of MU peripheral base addresses */
#define IP_MU_BASE_ADDRS                         { IP_DSP4__MU0__MUA_BASE, IP_DSP4__MU0__MUB_BASE, IP_DSP4__MU1__MUA_BASE, IP_DSP4__MU1__MUB_BASE, IP_DSP4__MU2__MUA_BASE, IP_DSP4__MU2__MUB_BASE, IP_DSP4__MU3__MUA_BASE, IP_DSP4__MU3__MUB_BASE }
/** Array initializer of MU peripheral base pointers */
#define IP_MU_BASE_PTRS                          { IP_DSP4__MU0__MUA, IP_DSP4__MU0__MUB, IP_DSP4__MU1__MUA, IP_DSP4__MU1__MUB, IP_DSP4__MU2__MUA, IP_DSP4__MU2__MUB, IP_DSP4__MU3__MUA, IP_DSP4__MU3__MUB }

/* ----------------------------------------------------------------------------
   -- MU Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MU_Register_Masks MU Register Masks
 * @{
 */

/*! @name VER - Version ID */
/*! @{ */

#define MU_VER_FEATURE_MASK                      (0xFFFFU)
#define MU_VER_FEATURE_SHIFT                     (0U)
#define MU_VER_FEATURE_WIDTH                     (16U)
#define MU_VER_FEATURE(x)                        (((uint32_t)(((uint32_t)(x)) << MU_VER_FEATURE_SHIFT)) & MU_VER_FEATURE_MASK)

